Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 141, 141, 64)      1792      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 70, 70, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 68, 68, 32)        18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 34, 34, 32)        0         
_________________________________________________________________
flatten (Flatten)            (None, 36992)             0         
_________________________________________________________________
dense (Dense)                (None, 128)               4735104   
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258       
=================================================================
Total params: 4,755,618
Trainable params: 4,755,618
Non-trainable params: 0
_________________________________________________________________
