Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 141, 141, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 70, 70, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 68, 68, 128)       36992     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 34, 34, 128)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 32)        36896     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 32)        0         
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               1048704   
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258       
=================================================================
Total params: 1,123,746
Trainable params: 1,123,746
Non-trainable params: 0
_________________________________________________________________
