Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 141, 141, 64)      640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 70, 70, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 313600)            0         
_________________________________________________________________
dense (Dense)                (None, 128)               40140928  
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258       
=================================================================
Total params: 40,141,826
Trainable params: 40,141,826
Non-trainable params: 0
_________________________________________________________________
